# vi: ft=ruby
# Configuration Management
tap 'thoughtbot/formulae'
brew 'rcm'

# Mac App Store CLI
brew 'mas'

# Programing languages
brew 'node'
brew 'nodenv'
brew 'python3'

# Shell Utilities
brew 'ag'
brew 'diff-so-fancy'
brew 'fzf'
brew 'gnu-sed'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'z'
brew 'zsh'

# Editors
tap 'neovim/neovim'
brew 'neovim'

tap 'aykamko/tag-ag'
brew 'tag-ag'

# Casks
tap 'caskroom/cask'
cask '1password'
cask 'aerial'
cask 'alfred'
cask 'bartender'
cask 'caffeine'
cask 'charles'
cask 'cloudapp'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'mailplane'
cask 'marked'
cask 'rescuetime'
cask 'scansnap-manager-ix500'
cask 'sketch'
cask 'spectacle'
cask 'zeplin'

# Mac App Store
mas 'Bear', id: 1091189122
mas 'Fantastical 2', id: 975937182
mas 'Things 3', id: 904280696
