# vi: ft=ruby
# Configuration Management
tap 'thoughtbot/formulae'
brew 'rcm'

# Programing languages
brew 'node'
brew 'nodenv'
brew 'python3'

# Shell Utilities
brew 'ag'
brew 'diff-so-fancy'
brew 'fzf'
brew 'gh'
brew 'gnu-sed'
brew 'ripgrep'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'z'
brew 'zsh'

# Editors
tap 'neovim/neovim'
brew 'neovim'

# Formatting
brew 'prettierd'
brew 'stylua'

# Casks
cask '1password'
cask 'adobe-creative-cloud'
cask 'balenaetcher'
cask 'bartender'
cask 'bazecor'
cask 'chatgpt'
cask 'discord'
cask 'ghostty'
cask 'font-sauce-code-pro-nerd-font'
cask 'iterm2'
cask 'lunar'
cask 'raycast'
cask 'rectangle'
cask 'reflect'
cask 'slack'
cask 'steam'
cask 'steermouse'
