# vi: ft=ruby
# Configuration Management
brew 'stow'

# Shell
brew 'fish'
brew 'starship'
brew 'atuin'
brew 'direnv'

# Shell Utilities
brew 'ag'
brew 'diff-so-fancy'
brew 'fzf'
brew 'gh'
brew 'gnu-sed'
brew 'ripgrep'
brew 'herdr'
brew 'mosh'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'z'
brew 'gogcli'
brew 'googleworkspace-cli'

# Languages
brew 'rust'

# Editors
tap 'neovim/neovim'
brew 'neovim'

# AI
brew 'pi-coding-agent'

# Personal Taps
tap 'blamattina/formulae'

# Formatting
brew 'prettierd'
brew 'stylua'

# Linting
brew 'eslint_d'
brew 'ruff'
brew 'shellcheck'
brew 'selene'

# Casks
cask '1password'
cask 'bartender'
cask 'chatgpt'
cask 'claude'
cask 'claude-code'
cask 'codex'
cask 'conductor'
cask 'dropbox'
cask 'ghostty'
cask 'font-sauce-code-pro-nerd-font'
cask 'iterm2'
cask 'lunar'
cask 'macwhisper'
cask 'obsidian'
cask 'raycast'
cask 'rectangle'
cask 'steermouse'
cask 'ticktick'
cask 'todoist-app'
